---
kind: method
id: M:Autodesk.Revit.DB.ExternalResourceType.#ctor(System.Guid)
source: html/672e5a94-3cbb-5a66-6ae4-2860eafa53a9.htm
---
# Autodesk.Revit.DB.ExternalResourceType.#ctor Method

Creates a new ExternalResourceType instance.

## Syntax (C#)
```csharp
public ExternalResourceType(
	Guid guid
)
```

## Parameters
- **guid** (`System.Guid`) - The identifier for the ExternalResourceType.